In [1]:
import pandas as pd

filename = '../data/airlines.dat'

df = pd.read_csv(filename)
df

,1,Private flight,\N,-,N/A,Unnamed: 5,Unnamed: 6,Y
0,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
1,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
2,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N
3,5,213 Flight Unit,\N,NaN,TFU,NaN,Russia,N
4,6,223 Flight Unit State Airline,\N,NaN,CHD,CHKALOVSK-AVIA,Russia,N
...,...,...,...,...,...,...,...,...
6042,19828,Vuela Cuba,Vuela Cuba,6C,6CC,NaN,Cuba,Y
6043,19830,All Australia,All Australia,88,8K8,NaN,Australia,Y
6044,19831,Fly Europa,NaN,ER,RWW,NaN,Spain,Y
6045,19834,FlyPortugal,NaN,PO,FPT,FlyPortugal,Portugal,Y
6046,19845,FTI Fluggesellschaft,NaN,NaN,FTI,NaN,Germany,N